nxp-appcodehub/an-mc-pmsm-mcxe31b/source/pin_mux.c
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_eMIOSPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '7', peripheral: EMIOS_0, signal: 'EMIOS_CH, 1_G', pin_signal: PTD1, identifier: PWM_AT, direction: OUTPUT}
  - {pin_num: '8', peripheral: EMIOS_0, signal: 'EMIOS_CH, 2_G', pin_signal: PTD0, identifier: PWM_AB, direction: OUTPUT}
  - {pin_num: '9', peripheral: EMIOS_0, signal: 'EMIOS_CH, 3_G', pin_signal: PTE11, identifier: PWM_BT, direction: OUTPUT}
  - {pin_num: '112', peripheral: EMIOS_0, signal: 'EMIOS_CH, 4_G', pin_signal: PTB16, direction: OUTPUT}
  - {pin_num: '110', peripheral: EMIOS_0, signal: 'EMIOS_CH, 5_G', pin_signal: PTB17, direction: OUTPUT}
  - {pin_num: '109', peripheral: EMIOS_0, signal: 'EMIOS_CH, 6_G', pin_signal: PTA17, direction: OUTPUT}
  - {peripheral: EMIOS_0, signal: 'OUT_DIS, 0', pin_signal: LPCMP_1_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_eMIOSPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_eMIOSPins(void)
{
    /* Clock enable: Clock is turned on. */
    CLOCK_EnableClock(kCLOCK_Trgmux);
    
    /* PTD1 (pin 7) is configured as EMIOS_0 EMIOS_CH, 1_G */
    const siul2_pin_settings_t BOARD_EMIOSPINS_PWM_AT =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 97u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_EMIOSPINS_PWM_AT);
    
    /* PTD0 (pin 8) is configured as EMIOS_0 EMIOS_CH, 2_G */
    const siul2_pin_settings_t BOARD_EMIOSPINS_PWM_AB =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 96u,
        .mux                         = kPORT_MUX_ALT2,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_EMIOSPINS_PWM_AB);
    
    /* PTE11 (pin 9) is configured as EMIOS_0 EMIOS_CH, 3_G */
    const siul2_pin_settings_t BOARD_EMIOSPINS_PWM_BT =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 139u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_EMIOSPINS_PWM_BT);
    
    /* PTB16 (pin 112) is configured as EMIOS_0 EMIOS_CH, 4_G */
    const siul2_pin_settings_t BOARD_EMIOSPINS_PWM_BB =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 48u,
        .mux                         = kPORT_MUX_ALT2,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_EMIOSPINS_PWM_BB);
    
    /* PTB17 (pin 110) is configured as EMIOS_0 EMIOS_CH, 5_G */
    const siul2_pin_settings_t BOARD_EMIOSPINS_PWM_CT =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 49u,
        .mux                         = kPORT_MUX_ALT2,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_EMIOSPINS_PWM_CT);
    
