nxp-appcodehub/an-mc-pmsm-mcxe31b/source/pin_mux.c
    /* PTA17 (pin 109) is configured as EMIOS_0 EMIOS_CH, 6_G */
    const siul2_pin_settings_t BOARD_EMIOSPINS_PWM_CB =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 17u,
        .mux                         = kPORT_MUX_ALT2,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_EMIOSPINS_PWM_CB);
    
    /* eMIOS_0_IPP_DO_eMIOS_CH[1] is selected as SIUL2 TRGMUX_OUT0 device trigger input 2 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut0, kTRGMUX_TriggerInput2, kTRGMUX_SourceEmios0IppDoEmiosCh1);
    /* eMIOS_0_IPP_DO_eMIOS_CH[3] is selected as SIUL2 TRGMUX_OUT1 device trigger input 1 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut1, kTRGMUX_TriggerInput1, kTRGMUX_SourceEmios0IppDoEmiosCh3);
    /* LPCMP_1 Comparator output is selected as eMIOS012_ODIS device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_Emios012_Odis, kTRGMUX_TriggerInput0, kTRGMUX_SourceLpcmp1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins_LCU:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '87', peripheral: LCU_1, signal: 'LC0_OUT, 0', pin_signal: PTC23, identifier: ptc23}
  - {pin_num: '88', peripheral: LCU_1, signal: 'LC0_OUT, 1', pin_signal: PTC24, identifier: ptc24}
  - {pin_num: '89', peripheral: LCU_1, signal: 'LC0_OUT, 2', pin_signal: PTC25, identifier: ptc25}
  - {pin_num: '91', peripheral: LCU_1, signal: 'LC2_OUT, 1', pin_signal: PTC26, identifier: ptc26}
  - {pin_num: '93', peripheral: LCU_1, signal: 'LC0_OUT, 3', pin_signal: PTC27, identifier: ptc27}
  - {pin_num: '96', peripheral: LCU_1, signal: 'LC2_OUT, 0', pin_signal: PTC28, identifier: ptc28}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_LCU
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins_LCU(void)
{
    
    /* PTC23 (pin 87) is configured as LCU_1 LC0_OUT, 0 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_ptc23 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 87u,
        .mux                         = kPORT_MUX_ALT6,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_ptc23);
    
    /* PTC24 (pin 88) is configured as LCU_1 LC0_OUT, 1 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_ptc24 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 88u,
        .mux                         = kPORT_MUX_ALT6,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_ptc24);
    
    /* PTC25 (pin 89) is configured as LCU_1 LC0_OUT, 2 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_ptc25 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 89u,
        .mux                         = kPORT_MUX_ALT6,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_ptc25);
    
