nxp-appcodehub/an-mc-pmsm-mcxe31b/source/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_LCU_aux
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins_LCU_aux(void)
{
    /* Clock enable: Clock is turned on. */
    CLOCK_EnableClock(kCLOCK_Trgmux);
    
    /* PTD1 (pin 7) is configured as LCU_0 LC0_OUT, 0 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_AUX_ptd1 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 97u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_AUX_ptd1);
    
    /* PTD0 (pin 8) is configured as LCU_0 LC0_OUT, 1 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_AUX_ptd0 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 96u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_AUX_ptd0);
    
    /* PTE11 (pin 9) is configured as LCU_0 LC0_OUT, 2 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_AUX_pte11 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 139u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_AUX_pte11);
    
    /* PTE10 (pin 10) is configured as LCU_0 LC0_OUT, 3 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_AUX_PTE10 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 138u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_AUX_PTE10);
    
    /* PTE16 (pin 4) is configured as LCU_0 LC1_OUT, 0 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_AUX_pte16 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 144u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_AUX_pte16);
    
    /* PTE15 (pin 5) is configured as LCU_0 LC1_OUT, 1 */
    const siul2_pin_settings_t BOARD_INITPINS_LCU_AUX_pte15 =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 143u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_NOT_AVAILABLE,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&BOARD_INITPINS_LCU_AUX_pte15);
    
    /* LCU_0 LC0 Out_i1 is selected as SIUL2 TRGMUX_OUT0 device trigger input 1 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut0, kTRGMUX_TriggerInput1, kTRGMUX_SourceLcu0Lc0Out1);
    /* LCU_0 LC0 Out_i0 is selected as SIUL2 TRGMUX_OUT0 device trigger input 2 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut0, kTRGMUX_TriggerInput2, kTRGMUX_SourceLcu0Lc0Out0);
    /* LCU_0 LC0 Out_i3 is selected as SIUL2 TRGMUX_OUT1 device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut1, kTRGMUX_TriggerInput0, kTRGMUX_SourceLcu0Lc0Out3);
    /* LCU_0 LC0 Out_i2 is selected as SIUL2 TRGMUX_OUT1 device trigger input 1 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut1, kTRGMUX_TriggerInput1, kTRGMUX_SourceLcu0Lc0Out2);
    /* LCU_0 LC1 Out_i1 is selected as SIUL2 TRGMUX_OUT1 device trigger input 2 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut1, kTRGMUX_TriggerInput2, kTRGMUX_SourceLcu0Lc1Out1);
    /* LCU_0 LC1 Out_i0 is selected as SIUL2 TRGMUX_OUT1 device trigger input 3 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_ExtOut1, kTRGMUX_TriggerInput3, kTRGMUX_SourceLcu0Lc1Out0);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
